paper_drafts/visual_based_fbctr_laparoscopy_softrobot/visual_based_fbctr_laparoscopy_softrobot.tex
% Created 2017-03-10 Fri 00:45
% Intended LaTeX compiler: pdflatex
\documentclass[journal,onecolumn]{IEEEtran}
                          \usepackage[pdftex]{graphicx}
\graphicspath{{../pdf/}{../jpeg/}}
\DeclareGraphicsExtensions{.pdf,.jpeg,.png}
\usepackage[cmex10]{amsmath}
\interdisplaylinepenalty=2500
\usepackage{cite}
\usepackage{epsfig}
\usepackage{epstopdf}
\usepackage[caption=false,font=footnotesize]{subfig}
\usepackage{bm}
\usepackage{color}
\usepackage{hyperref}
\author{Author 1, Author 2}
\date{\today}
\title{Visual-based Model-free Control of Soft Continuum Robot for Effective Endoscopic Navigation}
\hypersetup{
 pdfauthor={Author 1, Author 2},
 pdftitle={Visual-based Model-free Control of Soft Continuum Robot for Effective Endoscopic Navigation},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 9.0.1)}, 
 pdflang={English}}
\begin{document}

\maketitle
%\markboth{Journal of \LaTeX\ Class Files,~Vol.~6, No.~1, January~2007}%
%{Shell \MakeLowercase{\textit{et al.}}: Bare Demo of IEEEtran.cls for Journals}

%\IEEEpubid{0000--0000/00\$00.00~\copyright~2007 IEEE}

%\IEEEspecialpapernotice{(Invited Paper)}

%\maketitle

\begin{abstract}
%\boldmath
The abstract goes here.
\end{abstract}

\begin{IEEEkeywords}
IEEEtran, journal, \LaTeX, paper, template.
\end{IEEEkeywords}

\IEEEpeerreviewmaketitle
