paper_drafts/visual_based_fbctr_laparoscopy_softrobot/visual_based_fbctr_laparoscopy_softrobot.org
* Introduction                                                     
# #+LaTeX: % \IEEEPARstart{T}{his} 
# demo file is intended to serve as a ``starter file''
# for IEEE journal papers produced under \LaTeX\ using
# IEEEtran.cls version 1.7 and later.
# I wish you the best of success.
# #+LaTeX: \hfill \\
# mds
# #+LaTeX: \hfill \\
# January 11, 2007



  - Why do we use soft robot for endoscopy
    # what is the purpose of endoscope
    - Endoscope is an tubular instrument for intra-cavitary or intra-luminal inspection in minimal invasive surgical procedure.
    # Conventional endoscope and its design characteristic
    - In conventional design, an endoscope comprises of a long and flexible body and a cable-driven steerable tip mounted with a camera.
    - This slender body is pliant to the surrounding objects, which facilitates versatile operations within the confined surgical environments.
    - The orientation of the tip can be manipulated by antagonistically adjusting the tensions and positions of the embedded cables.
    - This allows directing the camera and delivering interventional instruments such as biopsy forceps at particular regions of interest.
    # Disadvantages of the conventional design that motivates the use of soft robot
    - However, the cable tensions are difficult to control [ref] for stable interventional procedures.
    - The rigidity of tip may also cause damage to the soft tissue or even perforation [ref] when the endoscope is forced to pass through narrow corners against interior luminal surfaces.
    - These drawbacks motivate the development of totally soft, fluid-driven continuum robotic systems for endoscopic interventions.
    # advantages of soft continuum robots
    - Soft continuum structure can be readily fabricated from hyperelastic materials such as silicone (e.g. Ecoflex) using advanced 3D-printed technologies [ref: pnet]. 
    - This enables production of low-cost and disposable soft endoscopes to facilitate sterilization process, where the risk of cross infection would be minimized [ref].
    - Briefly introduce achievements of soft continuum robots for surgical applications
      - Endotics [ref]
	- for colonoscopy
      - Aer-O-space [ref]
	- for colonoscopy
      - STIFFLOP [ref]
	- controllable stiffness
      - other examples [ref]
    # control is difficult 
    - Yet the kinematic and dynamic behavior of the deformable structure is usually highly nonlinear and is easily complicated by external disturbances.
    - Consequently the responses upon actuation can be dramatically unalike at different robot configurations. 
    - This pose difficulties in deriving control methods for precise manipulation of such soft continuum structure. 


  - Various close-loop control methods have been proposed for soft continuum robots.
    - Model-based approaches relies on obtaining close-formed solutions [ref] from analytical models of the robot's kinematics or dynamics [ref].
      - Several modeling methods have been proposed to approximate the hyperelastic behavior
      - piecewise contant curvature models [refs],
	- infintie degree-of-freedom systems [ref],
	- interconnected spring-mass systems [refs],
	- geometrically exact formulations based on Cosserat theory [ref].
      - Model-based controllers could be applied to regulate either cable-driven [ref] or fluid-driven continuum robots [ref], and even generate bio-mimicking sterotyped motions [ref].
      - However, the assumptions made could be invalid in the presence of disturbances such as payload and external interactions.
      - Complicated procedures are also required to determine proper analytical models and system parameters beforehand [ref].
      - Such system identification process inevitably have to be started from scratch, if the structural properties that govern the robot's mechanical behavior have been significantly modified.
      - These drawbacks hinder model-based methods from applications to robot manipulation the confined surgical environments involving substantial contacts.
    - Model-free approaches
      - NN
      - Yips
      - advantages of model-free approach
    - However, most of the literature assume feedback of absolute robot position is avaliable 

  - The visual servoing camera-in-hand problem and control in constrained environment 
  # and explain why we choose learning-based controller 
    - Endoscopic images are the primary source to provide positional feedback of robot in real time
    - provide immediate positional displacement in the image domain caused by the robot motion.
    - The minautrized camera at the distal tip can offer high resolutions images, which can be streamed to computing units for pattern recognition [ref]
    - because installation of additional positional sensors may be infeasible due to limited size or clinical constraints.
    - explain briefly the camera-in-hand problem visual-servoing
    - this problem have been extensively studied in the case of rigid-link manipulators [refs]
    - only one example could be found in the case of continuum robots and its methods
      - wang's model-based cable-driven visual servo [ref] 
    - no existing example of visual-based control for soft fluid-driven continuum robot 

  - propose our model-free visual servo approach
    - why nonparametric methods?
    - Contributions:
      - first attempt the camera-in-hand visual servoing for fluid-driven continuum robots for intra-luminal endoscopy
      - Novel model-free visual servoing control method (section II)
      - demonstrated enhanced manipulation in tele-mainpulation tasks (section III)

  #+begin_comment
    # why soft continuum robots
  Endoscopes are flexible and slender instruments for intra-luminal/intra-cavitary inspections in minimally invasive surgical procedures.
  Conventional endoscopes comprise of flexible metallic skeleton and steerable tip driven by embedded steel cables [refs].
  Such flexible continuum structure is pliant to the surrounding objects, thereby facilitating compliant interactions within confined cavity.
  However, the rigid distal tip may still induce trauma on the soft tissue, when the instrument is pushed against the interior wall inside confined lumen or cavity [ref].
  This motivates the development of totally soft, fluid-driven continuum robots for endoscopic interventions [ref of examples]. 
  The steerable tip can be made of hyperelastic materials such as silicone outright [ref: pnet]. 
  This also allows fabrication of low-cost disposable instrument to simplify sterilization and prevent cross infection.
  Yet, due to the deformable mechanical properties, the kinematic and dynamic behavior of the scope is highly nonlinear [ref sup. highly nonlinear claims].
  This prompts the need of adaptive robotic controller that can account for such nonlinear motion and external disturbance in order to enhance the manipulation accuracy in constrained environments.
      
  Various close-loop control methods have been proposed for soft continuum robots.
  Model-based approaches relies on obtaining close-formed solutions [ref] from analytical models of the robot's kinematics or dynamics [ref].
  Several modeling methods have been proposed to approximate the hyperelastic behavior based 
  As such, the can be approximated as piecewise contant curvature models [refs], infintie degree-of-freedom systems [ref], interconnected spring-mass systems [refs], and geometrically exact formulations based on Cosserat theory [ref].
  Model-based controllers could be applied to regulate either cable-driven [ref] or fluid-driven continuum robots [ref], and even generate bio-mimicking sterotyped motions [ref].
  However, the assumptions made could be invalid in the presence of disturbances such as payload and external interactions.
  Complicated procedures are also required to determine proper analytical models and system parameters beforehand [ref].
  Such system identification process inevitably have to be started from scratch, if the structural properties that govern the robot's mechanical behavior have been significantly modified.
  These drawbacks hinder model-based methods from applications to robot manipulation the confined surgical environments involving substantial contacts.

  - Endoscopic images are the primary source to provide positional feedback of robot in real time
  - The minautrized camera at the distal tip can offer high resolutions images, which can be streamed to computing units for pattern recognition [ref], and
  - because installation of additional positional sensors may be infeasible due to limited size or clinical constraints.
  - provide immediate positional displacement in the image domain caused by the robot motion.



    - model-free approach
      - 

    - The control performance of the soft robots can be enhanced by implementation of close-loop controllers.
    - The real-time endsocopic image feedback can be used to close the loop of the robotic control.
    - difficulty of miniaturization while installing other tethered positional sensors
      - reliable sensors are mostly tethered. including tethered sensor would complicate the dynamics of the soft continuum robot and thus increase control difficulty
    - examples of using visual-feedback for robotizing endoscopes
      - visual-based feedback is also mostly use for surgical tool tracking. visual-based controller of the surgical tools is developed making use of 
the tracked position.
    - no existing example of visual-based control for soft fluid-driven continuum robot 

  - what is the visual servoing definition in this paper?
    - control of a soft continuum robot, which mounted with camera at the tip, using only visual feedback
    - what is the state-of-the art the visual-servoing for manipulation of endoscope?
      - control needs to compute the inverse mapping of the soft robot
	- mapping from the user input to the actuation pressure
	- usually redundancy is the problem of computing the inverse mapping
      - examples of model-based approach
	- e.g. PCC approach 
      - model-based approach is difficult since it is difficult to obtain accurate analytical model of soft continuum robot
      - model-free approach of controlling
	- advantage of model-free approach
	- e.g. data-driven based approaches that approximate the inverse mapping by regression
	- local learning is one of the learning approach that can resolve the redundancy problem
	  - have been successfully applied to learning inverse mapping for controlling redundant rigid-link robots
    - contribution
      - visual-servoing of a soft continuum robot for laparoscopic surgery that can
	- enhance the tele-manipulation accuracy
	- automatically trace a target point specified in the endoscopic view
  #+end_comment 



