paper_drafts/visual_based_fbctr_laparoscopy_softrobot/visual_based_fbctr_laparoscopy_softrobot.tex


\section{Introduction}
\label{sec:orge82a4f9}
\begin{itemize}
\item Why do we use soft robot for endoscopy

\begin{itemize}
\item Endoscope is an tubular instrument for intra-cavitary or intra-luminal inspection in minimal invasive surgical procedure.

\item In conventional design, an endoscope comprises of a long and flexible body and a cable-driven steerable tip mounted with a camera.
\item This slender body is pliant to the surrounding objects, which facilitates versatile operations within the confined surgical environments.
\item The orientation of the tip can be manipulated by antagonistically adjusting the tensions and positions of the embedded cables.
\item This allows directing the camera and delivering interventional instruments such as biopsy forceps at particular regions of interest.

\item However, the cable tensions are difficult to control [ref] for stable interventional procedures.
\item The rigidity of tip may also cause damage to the soft tissue or even perforation [ref] when the endoscope is forced to pass through narrow corners against interior luminal surfaces.
\item These drawbacks motivate the development of totally soft, fluid-driven continuum robotic systems for endoscopic interventions.

\item Soft continuum structure can be readily fabricated from hyperelastic materials such as silicone (e.g. Ecoflex) using advanced 3D-printed technologies [ref: pnet].
\item This enables production of low-cost and disposable soft endoscopes to facilitate sterilization process, where the risk of cross infection would be minimized [ref].
\item Briefly introduce achievements of soft continuum robots for surgical applications
\begin{itemize}
\item Endotics [ref]
\begin{itemize}
\item for colonoscopy
\end{itemize}
\item Aer-O-space [ref]
\begin{itemize}
\item for colonoscopy
\end{itemize}
\item STIFFLOP [ref]
\begin{itemize}
\item controllable stiffness
\end{itemize}
\item other examples [ref]
\end{itemize}

\item Yet the kinematic and dynamic behavior of the deformable structure is usually highly nonlinear and is easily complicated by external disturbances.
\item Consequently the responses upon actuation can be dramatically unalike at different robot configurations.
\item This pose difficulties in deriving control methods for precise manipulation of such soft continuum structure.
\end{itemize}
\end{itemize}


\begin{itemize}
\item Various close-loop control methods have been proposed for soft continuum robots.
\begin{itemize}
\item Model-based approaches relies on obtaining close-formed solutions [ref] from analytical models of the robot's kinematics or dynamics [ref].
\begin{itemize}
\item Several modeling methods have been proposed to approximate the hyperelastic behavior
\item piecewise contant curvature models [refs],
\begin{itemize}
\item infintie degree-of-freedom systems [ref],
\item interconnected spring-mass systems [refs],
\item geometrically exact formulations based on Cosserat theory [ref].
\end{itemize}
\item Model-based controllers could be applied to regulate either cable-driven [ref] or fluid-driven continuum robots [ref], and even generate bio-mimicking sterotyped motions [ref].
\item However, the assumptions made could be invalid in the presence of disturbances such as payload and external interactions.
\item Complicated procedures are also required to determine proper analytical models and system parameters beforehand [ref].
\item Such system identification process inevitably have to be started from scratch, if the structural properties that govern the robot's mechanical behavior have been significantly modified.
\item These drawbacks hinder model-based methods from applications to robot manipulation the confined surgical environments involving substantial contacts.
\end{itemize}
\item Model-free approaches
\begin{itemize}
\item NN
\item Yips
\item advantages of model-free approach
\end{itemize}
\item However, most of the literature assume feedback of absolute robot position is avaliable
\end{itemize}

\item The visual servoing camera-in-hand problem and control in constrained environment 

\begin{itemize}
\item Endoscopic images are the primary source to provide positional feedback of robot in real time
\item provide immediate positional displacement in the image domain caused by the robot motion.
\item The minautrized camera at the distal tip can offer high resolutions images, which can be streamed to computing units for pattern recognition [ref]
\item because installation of additional positional sensors may be infeasible due to limited size or clinical constraints.
\item explain briefly the camera-in-hand problem visual-servoing
\item this problem have been extensively studied in the case of rigid-link manipulators [refs]
\item only one example could be found in the case of continuum robots and its methods
\begin{itemize}
\item wang's model-based cable-driven visual servo [ref]
\end{itemize}
\item no existing example of visual-based control for soft fluid-driven continuum robot
\end{itemize}

\item propose our model-free visual servo approach
\begin{itemize}
\item why nonparametric methods?
\item Contributions:
\begin{itemize}
\item first attempt the camera-in-hand visual servoing for fluid-driven continuum robots for intra-luminal endoscopy
\item Novel model-free visual servoing control method (section II)
\item demonstrated enhanced manipulation in tele-mainpulation tasks (section III)
\end{itemize}
\end{itemize}
\end{itemize}
