paper_drafts/visual_based_fbctr_laparoscopy_softrobot/visual_based_fbctr_laparoscopy_softrobot.org
* Materials and methods                                            
  
** Overall control architecture for tele-manipulation
- Explanation of the tele-manipulation in endoscopic navigation
  - Fig.1 : Schematic diagram of the overall control architecture
  - Components: the user input, the controller, the robot, the endoscopic camera

- Definition of the control problem
  - redundantly actuated soft robot
    - Fig. 2: sketch of the soft robot 
  - we consider operational space control
    - 

** Real-time image processing 
   - what is the output of the image processing
     - the displacement in the endoscopic view
     - use filter technique to smooth the output
     - is the smoothing technique specific for the endoscopic environment?

** Model-free Kinematic control 
*** Kinematic transition of soft continuum robot
    - general nonlinear function to describe the kinematic relation
      - why quasi-static?
	- robot tip motion should be gentle for smooth output in the endoscopic view
	- large pressure change must be prohibited
      - quasi-static transition model [ref]
	- the robot is in stationary condition at time step $k$ with static chamber pressure $\bm{u}_k$ 
	- the robot state is represented $\bm{x}_k$
      - when the chamber pressure is changed by $\Delta\bm{u}_k$, the state at the next time step is:
      - $\bm{x}_{k+1} = f(\bm{x}_k,\Delta\bm{u}_k, \bm{\eta}_k)$ or $\bm{x}_{k+1} = f(\bm{x}_k,\Delta\bm{u}_k) + \bm{\eta}_k$
      - where $bm{\eta}_k$ is unknown external disturbance
	- e.g. ???
      - kinematics relative to a base frame
	- indicate in Fig. 2 
      - In endoscopic procedure, image feedback is the only available feedback to close the robotic control loop
      - The tip orientation $\bm{y}_k$, and the corresponding image output $\bm{z}$ are 
	- $\bm{y}_k = g_e(\bm{x}_k)$
	- $\bm{z}_k = g_c(\bm{y}_k) + \bm{\tilde \epsilon}_k$
	- where \bm{\epsilon}_k is the measurement noise
    - During the tele-manipulation process, the desired target $\bm{z}_{k+1}^*$ is given by the operator via the user input.
    - Therefore, the controller needs to compute the required change of chamber pressure $\Delta \bm{u}_k$, which can be represented as the inverse kinematic model below:
      - $\Delta \bm{u}=\tilde \pi(\bm{x}, \bm{\eta}, \bm{z}_k, \bm{z}_{k+1}^{*}) + \bm{\epsilon}$
      - $\bm{\epsilon}$ is the noise resulting from the measurement inaccuracy 
    - however, $\bm{x}$ and $\bm{\eta}$ are unknown.
    - Under the quasi-static transition behavior, we hypothesize that the pressure $\bm{u}_k$ can provide information of the state $\bm{x}_k$.
    - Besides, the controller have to adapt the external disturbance $\bm{\eta}_k$, which inherently affects the robot transition.
    - Therefore, we propose to adopt online learning technique to acquire the following approximated inverse model from measurement data:
    - $\Delta \bm{u}= \pi(\bm{u}, \bm{z}_k, \bm{z}_{k+1}^{*}) + \bm{\epsilon}$

*** Estimation of the absolute position from real-time visual feedback
    - use image displacement and the chamber pressure at the last time step to estimate the absolute orientation
    - $\bm{\hat s}_k = h(\Delta \bm{z}_k,\bm{u}_{k-1})$
    - this estimation will be employed in the model-free controller described below.

*** Learning the inverse model for operational space control
    - brief introduction of online nonparametric method
      - advantages of directly learning the inverse
	- low gain feedback controller
      - difficulty in directly learning the inverse
	- redundancy problem in the control space
    - proposed our method
      - how to resolve the redundancy problem
    - discuss the difference from related works regarding the learning/control methods

* Results and discussion                                           
  - (Validation by simulation)
    - 
  - experimental setup
    - Description of the endoscope prototype
      - dimension, bending angle, basic endoscopic functions: e.g. insulflation, irrigation, ...
      - Fig. 3
    - Description of the experimental platform
      - The base of the robot is fixed
      - to simulate the colonoscopy procedure, in which the operator searches for specific features such as polyps.
      - Fig. 4a, b
	- a: overall setting, with EM tracker at the tip
	- b: endoscopic view with feature markers
    - To quantitatively evaluate the benefits to the navigation procedure, we measures the performance of the tele-manipulation task in terms of
      - completion time
      - the discrepancy between the desired and the actual image displacement
    - #xx subjects were divided into 3 groups, in each of which the subjects performed the task using
      - open-loop control
      - EM-based feedback
      - Visual-based feedback
  - Results
    - Table I. performance indexes of the 3 cases
    - Fig. 3D trajectories of the 3 cases
    - overlayed on a virtual colon model

* Conclusion

# #+LaTeX: \appendices
# * Proof of the First Zonklar Equation
# Appendix one text goes here.

# * 
# Appendix two text goes here.

# Reference 
#+LaTeX: \bibliographystyle{IEEEtran}
#+LaTeX: \bibliography{IEEEabrv,./FEA_design_endoscopy.bib}

\clearpage

* notes								   :noexport:
- always work in ~/Dropbox/org/paper_drafts/visual_based_fbctr_laparoscopy_softrobot/
  - cd /Users/Denny/Dropbox/org/paper_drafts/visual_based_fbctr_laparoscopy_softrobot/
- export to .docx in shell
  - pandoc -s -S visual_based_fbctr_laparoscopy_softrobot.org --bibliography=visual_based_fbctr_laparoscopy_softrobot.bib -o visual_based_fbctr_laparoscopy_softrobot.docx
- figures in /fig/figs.pptx

- copy to cloud
  - cp -a -p ./* ~/Dropbox/visual_based_fbctr_laparoscopy_softrobot/
  - cp -a -p ./fig/* ~/Dropbox/visual_based_fbctr_laparoscopy_softrobot/fig
- copy to local
  - cp -a -p ./* ~/Desktop/visual_based_fbctr_laparoscopy_softrobot/
  - cp -a -p ./fig/* ~/Desktop/visual_based_fbctr_laparoscopy_softrobot/fig
- use \C-c ( to insert ~\cite{citation}

** ethics  
   
