paper_drafts/visual_based_fbctr_laparoscopy_softrobot/visual_based_fbctr_laparoscopy_softrobot.tex

\section{Materials and methods}
\label{sec:org0ec4b0d}

\subsection{Overall control architecture for tele-manipulation}
\label{sec:org7236731}
\begin{itemize}
\item Explanation of the tele-manipulation in endoscopic navigation
\begin{itemize}
\item Fig.1 : Schematic diagram of the overall control architecture
\item Components: the user input, the controller, the robot, the endoscopic camera
\end{itemize}

\item Definition of the control problem
\begin{itemize}
\item redundantly actuated soft robot
\begin{itemize}
\item Fig. 2: sketch of the soft robot
\end{itemize}
\item we consider operational space control
\begin{itemize}
\item 
\end{itemize}
\end{itemize}
\end{itemize}

\subsection{Real-time image processing}
\label{sec:orgfbb6cfb}
\begin{itemize}
\item what is the output of the image processing
\begin{itemize}
\item the displacement in the endoscopic view
\item use filter technique to smooth the output
\item is the smoothing technique specific for the endoscopic environment?
\end{itemize}
\end{itemize}

\subsection{Model-free Kinematic control}
\label{sec:orgcef095b}
\subsubsection{Kinematic transition of soft continuum robot}
\label{sec:org27c0e68}
\begin{itemize}
\item general nonlinear function to describe the kinematic relation
\begin{itemize}
\item why quasi-static?
\begin{itemize}
\item robot tip motion should be gentle for smooth output in the endoscopic view
\item large pressure change must be prohibited
\end{itemize}
\item quasi-static transition model [ref]
\begin{itemize}
\item the robot is in stationary condition at time step \(k\) with static chamber pressure \(\bm{u}_k\)
\item the robot state is represented \(\bm{x}_k\)
\end{itemize}
\item when the chamber pressure is changed by \(\Delta\bm{u}_k\), the state at the next time step is:
\item \(\bm{x}_{k+1} = f(\bm{x}_k,\Delta\bm{u}_k, \bm{\eta}_k)\) or \(\bm{x}_{k+1} = f(\bm{x}_k,\Delta\bm{u}_k) + \bm{\eta}_k\)
\item where \(bm{\eta}_k\) is unknown external disturbance
\begin{itemize}
\item e.g. ???
\end{itemize}
\item kinematics relative to a base frame
\begin{itemize}
\item indicate in Fig. 2
\end{itemize}
\item In endoscopic procedure, image feedback is the only available feedback to close the robotic control loop
\item The tip orientation \(\bm{y}_k\), and the corresponding image output \(\bm{z}\) are 
\begin{itemize}
\item \(\bm{y}_k = g_e(\bm{x}_k)\)
\item \(\bm{z}_k = g_c(\bm{y}_k) + \bm{\tilde \epsilon}_k\)
\item where \bm{\epsilon}\(_{\text{k}}\) is the measurement noise
\end{itemize}
\end{itemize}
\item During the tele-manipulation process, the desired target \(\bm{z}_{k+1}^*\) is given by the operator via the user input.
\item Therefore, the controller needs to compute the required change of chamber pressure \(\Delta \bm{u}_k\), which can be represented as the inverse kinematic model below:
\begin{itemize}
\item \(\Delta \bm{u}=\tilde \pi(\bm{x}, \bm{\eta}, \bm{z}_k, \bm{z}_{k+1}^{*}) + \bm{\epsilon}\)
\item \(\bm{\epsilon}\) is the noise resulting from the measurement inaccuracy
\end{itemize}
\item however, \(\bm{x}\) and \(\bm{\eta}\) are unknown.
\item Under the quasi-static transition behavior, we hypothesize that the pressure \(\bm{u}_k\) can provide information of the state \(\bm{x}_k\).
\item Besides, the controller have to adapt the external disturbance \(\bm{\eta}_k\), which inherently affects the robot transition.
\item Therefore, we propose to adopt online learning technique to acquire the following approximated inverse model from measurement data:
\item \(\Delta \bm{u}= \pi(\bm{u}, \bm{z}_k, \bm{z}_{k+1}^{*}) + \bm{\epsilon}\)
\end{itemize}

\subsubsection{Estimation of the absolute position from real-time visual feedback}
\label{sec:org634f1af}
\begin{itemize}
\item use image displacement and the chamber pressure at the last time step to estimate the absolute orientation
\item \(\bm{\hat s}_k = h(\Delta \bm{z}_k,\bm{u}_{k-1})\)
\item this estimation will be employed in the model-free controller described below.
\end{itemize}

\subsubsection{Learning the inverse model for operational space control}
\label{sec:org7b72897}
\begin{itemize}
\item brief introduction of online nonparametric method
\begin{itemize}
\item advantages of directly learning the inverse
\begin{itemize}
\item low gain feedback controller
\end{itemize}
\item difficulty in directly learning the inverse
\begin{itemize}
\item redundancy problem in the control space
\end{itemize}
\end{itemize}
\item proposed our method
\begin{itemize}
\item how to resolve the redundancy problem
\end{itemize}
\item discuss the difference from related works regarding the learning/control methods
\end{itemize}

\section{Results and discussion}
\label{sec:orgcdea614}
\begin{itemize}
\item (Validation by simulation)
\begin{itemize}
\item 
\end{itemize}
\item experimental setup
\begin{itemize}
\item Description of the endoscope prototype
\begin{itemize}
\item dimension, bending angle, basic endoscopic functions: e.g. insulflation, irrigation, \ldots{}
\item Fig. 3
\end{itemize}
\item Description of the experimental platform
\begin{itemize}
\item The base of the robot is fixed
\item to simulate the colonoscopy procedure, in which the operator searches for specific features such as polyps.
\item Fig. 4a, b
\begin{itemize}
\item a: overall setting, with EM tracker at the tip
\item b: endoscopic view with feature markers
\end{itemize}
\end{itemize}
\item To quantitatively evaluate the benefits to the navigation procedure, we measures the performance of the tele-manipulation task in terms of
\begin{itemize}
\item completion time
\item the discrepancy between the desired and the actual image displacement
\end{itemize}
\item \#xx subjects were divided into 3 groups, in each of which the subjects performed the task using
\begin{itemize}
\item open-loop control
\item EM-based feedback
\item Visual-based feedback
\end{itemize}
\end{itemize}
\item Results
\begin{itemize}
\item Table I. performance indexes of the 3 cases
\item Fig. 3D trajectories of the 3 cases
\item overlayed on a virtual colon model
\end{itemize}
\end{itemize}

\section{Conclusion}
\label{sec:orga1dc18f}

\bibliographystyle{IEEEtran}
\bibliography{IEEEabrv,./FEA_design_endoscopy.bib}

\clearpage
\end{document}